# RT-DETR-R50 最终创新版: [DEConv] + [Agent-AIFI] + [SPD-P2-NWD]
# 严格对齐索引: [24, 27, 30, 33] -> RTDETRDecoder
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
# Ai缝合怪 RT-DETR创新改进
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # --- 创新点1: DEConv (局部特征增强) ---
  - [-1, 1, Blocks, [64,  DEBottleNeck, 3, 2, 'relu']] # 4-P2/4

  # --- 创新点3a: SPDConv (无损下采样) ---
  - [-1, 1, SPDConv, [128]] # 5-P3/8
  - [-1, 1, Blocks, [128, DEBottleNeck, 4, 2, 'relu']] # 6-P3/8

  - [-1, 1, SPDConv, [256]] # 7-P4/16
  - [-1, 1, Blocks, [256, DEBottleNeck, 6, 2, 'relu']] # 8-P4/16

  - [-1, 1, SPDConv, [512]] # 9-P5/32
  - [-1, 1, Blocks, [512, DEBottleNeck, 3, 2, 'relu']] # 10-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11
  
  # --- 创新点2: Agent Attention (深层语义交互) ---
  - [-1, 1, Agent_AIFI, [1024, 8]] # 12 
  - [-1, 1, Conv, [256, 1, 1]] # 13, Y5 lateral

  # --- 创新点3b: 扩展 P2 预测层 (Top-Down) ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15
  - [[-2, -1], 1, Concat, [1]] # 16
  - [-1, 3, RepC3, [256]] # 17 (F4)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 19
  - [[-2, -1], 1, Concat, [1]] # 20 (F3)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 22
  - [[-2, -1], 1, Concat, [1]] # 23 
  - [-1, 3, RepC3, [256]] # 24 (X2: 最终 P2 层) -> 对应 Decoder 第1个输入

  # --- PAN 路径: 全面引入 SPDConv 下采样 ---
  - [-1, 1, SPDConv, [256]] # 25 (F2->F3)
  - [[-1, 20], 1, Concat, [1]] # 26 (与 Y3 Concat)
  - [-1, 3, RepC3, [256]] # 27 (F3 out) -> 对应 Decoder 第2个输入

  - [-1, 1, SPDConv, [256]] # 28 (F3->F4)
  - [[-1, 17], 1, Concat, [1]] # 29 (与 Y4 Concat)
  - [-1, 3, RepC3, [256]] # 30 (F4 out) -> 对应 Decoder 第3个输入

  - [-1, 1, SPDConv, [256]] # 31 (F4->F5)
  - [[-1, 13], 1, Concat, [1]] # 32 (与 Y5 Concat)
  - [-1, 3, RepC3, [256]] # 33 (F5 out) -> 对应 Decoder 第4个输入

  # --- 最终输出与 NWDLoss ---
  - [[24, 27, 30, 33], 1, RTDETRDecoder, [nc]] # Detect(P2, P3, P4, P5)